Dropbox/emacs/configuration.el

(add-hook 'before-save-hook 'time-stamp)

(setq
  time-stamp-pattern nil
  time-stamp-active t          ; do enable time-stamps
  time-stamp-line-limit 12     ; check first 10 buffer lines for Time-stamp:
  time-stamp-format "%04y-%02m-%02d %02H:%02M:%02S (%u)") ; date format

(use-package header2
  :config
  (progn

    (defconst gh/header-sep-line-char ?-
      "Character to be used for creating separator lines in header.")

    (defconst gh/header-border-line-char ?=
      "Character to be used for creating border lines in header.")

    (defconst gh/auto-headers-hooks '(latex-mode-hook
                                      LaTeX-mode-hook)
      "List of hooks of major modes in which headers should be auto-inserted.")

    (defvar gh/header-timestamp-cond (lambda () t)
      "This variable should be set to a function that returns a non-nil
      value only when the time stamp is supposed to be inserted. By default, it's
      a `lambda' return `t', so the time stamp is always inserted.")

    (defun gh/turn-on-auto-headers ()
      "Turn on auto headers only for specific modes."
      (interactive)
      (dolist (hook gh/auto-headers-hooks)
        (add-hook hook #'auto-make-header)))

    (defun gh/turn-off-auto-headers ()
      "Turn off auto headers only for specific modes."
      (interactive)
      (dolist (hook gh/auto-headers-hooks)
        (remove-hook hook #'auto-make-header)))


    (defsubst gh/header-sep-line ()
      "Insert separator line"
      (insert header-prefix-string)
      (insert-char gh/header-sep-line-char (- fill-column (current-column)))
      (insert "\n"))

    (defsubst gh/header-border-line ()
      "Insert separator line"
      (insert header-prefix-string)
      (insert-char gh/header-border-line-char (- fill-column (current-column)))
      (insert "\n"))


    (defsubst gh/header-file-name ()
      "Insert \"File Name\" line, using buffer's file name."
      (insert header-prefix-string "File Name          : "
              (if (buffer-file-name)
                  (file-name-nondirectory (buffer-file-name))
                (buffer-name))
              "\n"))

    (defsubst gh/header-author ()
      "Insert current user's name (`user-full-name') as this file's author."
      (insert header-prefix-string "Author             : "
              (user-full-name)
              "\n"))

    (defsubst gh/header-mail ()
      "Insert current user's name (`user-mail-address') as this file's author."
      (insert header-prefix-string "Author e-mail      : "
              user-mail-address
              "\n"))

    (defsubst gh/header-description ()
      "Insert \"Description\" line."
      (insert header-prefix-string "Description        : \n"))

    (defsubst gh/header-creation-date ()
      "Insert todays date as the time of last modification."
      (insert header-prefix-string "Created            : "
              (header-date-string)
              "\n"))

    (defsubst gh/header-timestamp ()
      "Insert field for time stamp."
      (when (funcall gh/header-timestamp-cond)
      (insert header-prefix-string "Time-stamp: <>\n")))

    (defsubst gh/header-modification-date ()
      "Insert todays date as the time of last modification.
       This is normally overwritten with each file save."
      (insert header-prefix-string "Last-Updated       :"
              "\n"))


    (defsubst gh/header-position-point ()
      "Position the point at a particular point in the file.
Bring the point 2 lines below the current point."
      (forward-line 0)
      (newline 2))


    (setq make-header-hook '(gh/header-border-line
                             header-blank
                             gh/header-file-name
                             gh/header-author
                             gh/header-mail
                             gh/header-creation-date
                             header-blank
                             gh/header-sep-line
                             header-blank
                             gh/header-timestamp
                             header-blank
                             gh/header-sep-line
                             header-blank
                             gh/header-description
                             header-modification-date
                             header-blank
                             gh/header-border-line
                             gh/header-position-point))
    (gh/turn-on-auto-headers)
    ))

(use-package dired-details)
(use-package dired+)

(use-package dired-open
  :config
  (setq dired-open-extensions
        '(("pdf" . "evince")
          ("mkv" . "vlc")
          ("mp4" . "vlc")
          ("avi" . "vlc"))))

(setq-default dired-listing-switches "-lhvA")

(evil-define-key 'normal dired-mode-map (kbd "j") 'dired-next-line)
(evil-define-key 'normal dired-mode-map (kbd "k") 'dired-previous-line)

(setq dired-clean-up-buffers-too t)

(setq dired-recursive-copies 'always)

(setq dired-recursive-deletes 'top)

(defun dired-xdg-open ()
  "In dired, open the file named on this line."
  (interactive)
  (let* ((file (dired-get-filename nil t)))
    (call-process "xdg-open" nil 0 nil file)))

(define-key dired-mode-map (kbd "C-c C-o") 'dired-xdg-open)

(use-package projectile
  :ensure t
  :config
  (projectile-global-mode))

(use-package hydra
  :ensure t)

(use-package engine-mode
 :ensure t
 :config
 (engine/set-keymap-prefix (kbd "C-s"))
 (progn
    (defengine priberam
    "https://www.priberam.pt/dlpo/%s"
    :keybinding "p")

 (engine-mode t)))

(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status)

  :config
  (use-package evil-magit
    :ensure t)
  (setq magit-push-always-verify nil)
  (setq git-commit-summary-max-length 50)
  (add-hook 'git-commit-mode-hook 'turn-on-flyspell)
  (add-hook 'with-editor-mode-hook 'evil-insert-state))

(defun gh/toggle-maximize-buffer () "Maximize buffer"
  (interactive)
  (if (= 1 (length (window-list)))
      (jump-to-register '_)
    (progn
      (window-configuration-to-register '_)
      (delete-other-windows))))

(global-set-key [f9] 'gh/toggle-maximize-buffer)
